FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC43xx/LPC43xx_Serial.c
    p_info->iUART->MCR = (aControl & 0xFF);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine: LPC43xx_Serial_GetHandshakingStatus
 *---------------------------------------------------------------------------*
 * Description:
 *      Set the handshaking control for this serial port (if it has it)
 * Inputs:
 *      void *aWorkspace          -- Serial port workspace
 *      T_serialHandshakingStatus *aStatus -- Current status
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC43xx_Serial_GetHandshakingStatus(
        void *aWorkspace,
        T_serialHandshakingStatus *aStatus)
{
    T_Serial_LPC43xx_Workspace *p = (T_Serial_LPC43xx_Workspace *)aWorkspace;
    const T_Serial_LPC43xx_SerialInfo *p_info = p->iInfo;

    *aStatus = (p_info->iUART->MSR & 0xFF);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine: LPC43xx_Serial_GetStatus
 *---------------------------------------------------------------------------*
 * Description:
 *      Return the status of the port
 * Inputs:
 *      void *aWorkspace          -- Serial port workspace
 * Outputs:
 *      T_serialStatusByte          -- Status byte returned
 *---------------------------------------------------------------------------*/
T_serialStatusByte LPC43xx_Serial_GetStatus(void *aWorkspace)
{
    T_serialStatusByte status = 0;
    T_Serial_LPC43xx_Workspace *p = (T_Serial_LPC43xx_Workspace *)aWorkspace;

    // Only empty if both TEMT and THRE are empty
    if (p->iInfo->iUART->LSR & ((1 << 6) | (1 << 5))) {
        // not empty
    } else {
        status |= SERIAL_STATUS_TRANSMIT_EMPTY;
    }

    return status;
}

/*---------------------------------------------------------------------------*
 * Globals:
 *---------------------------------------------------------------------------*/
// List of serial port HAL interfaces
const HAL_Serial G_LPC43xx_Serial_UART0 = {
        {
        "Serial:LPC43XX UART0",
        0x0100,
        LPC43xx_Serial_InitializeWorkspace_UART0,
        sizeof(T_Serial_LPC43xx_Workspace),
        },

        LPC43xx_Serial_Configure,
        LPC43xx_Serial_SetSerialSettings,
        LPC43xx_Serial_GetSerialSettings,
        LPC43xx_Serial_Activate,
        LPC43xx_Serial_Deactivate,
        LPC43xx_Serial_OutputByte,
        0,
        0,
        LPC43xx_Serial_GetStatus, };

const HAL_Serial G_LPC43xx_Serial_UART1 = {
        {
        "Serial:LPC43XX UART1",
        0x0100,
        LPC43xx_Serial_InitializeWorkspace_UART1,
        sizeof(T_Serial_LPC43xx_Workspace),
        },

        LPC43xx_Serial_Configure,
        LPC43xx_Serial_SetSerialSettings,
        LPC43xx_Serial_GetSerialSettings,
        LPC43xx_Serial_Activate,
        LPC43xx_Serial_Deactivate,
        LPC43xx_Serial_OutputByte,
        LPC43xx_Serial_SetHandshakingControl,
        LPC43xx_Serial_GetHandshakingStatus,
        LPC43xx_Serial_GetStatus, };

const HAL_Serial G_LPC43xx_Serial_UART2 = {
        {
        "Serial:LPC43XX UART2",
        0x0100,
        LPC43xx_Serial_InitializeWorkspace_UART2,
        sizeof(T_Serial_LPC43xx_Workspace),
        },

        LPC43xx_Serial_Configure,
        LPC43xx_Serial_SetSerialSettings,
        LPC43xx_Serial_GetSerialSettings,
        LPC43xx_Serial_Activate,
        LPC43xx_Serial_Deactivate,
        LPC43xx_Serial_OutputByte,
        0,
        0,
        LPC43xx_Serial_GetStatus, };

const HAL_Serial G_LPC43xx_Serial_UART3 = {
        {
        "Serial:LPC43XX UART3",
        0x0100,
        LPC43xx_Serial_InitializeWorkspace_UART3,
        sizeof(T_Serial_LPC43xx_Workspace),
        },

        LPC43xx_Serial_Configure,
        LPC43xx_Serial_SetSerialSettings,
        LPC43xx_Serial_GetSerialSettings,
        LPC43xx_Serial_Activate,
        LPC43xx_Serial_Deactivate,
        LPC43xx_Serial_OutputByte,
        0,
        0,
        LPC43xx_Serial_GetStatus, };
	
const T_Serial_LPC43xx_SerialInfo G_LPC43xx_Serial_Info_UART0 = {
        USART0_IRQn,
        INTERRUPT_PRIORITY_HIGH,
        (T_16550UART *)LPC_USART0_BASE,
        (TISRFPtr)ISerialUART0,
        3, // PCUART0
        };

const T_Serial_LPC43xx_SerialInfo G_LPC43xx_Serial_Info_UART1 = {
        UART1_IRQn,
        INTERRUPT_PRIORITY_HIGH,
        (T_16550UART *)LPC_UART1_BASE,
        (TISRFPtr)ISerialUART1,
        4, // PCUART1
        };

const T_Serial_LPC43xx_SerialInfo G_LPC43xx_Serial_Info_UART2 = {
        USART2_IRQn,
        INTERRUPT_PRIORITY_HIGH,
        (T_16550UART *)LPC_USART2_BASE,
        (TISRFPtr)ISerialUART2,
        24, // PCUART2
        };

const T_Serial_LPC43xx_SerialInfo G_LPC43xx_Serial_Info_UART3 = {
        USART3_IRQn,
        INTERRUPT_PRIORITY_HIGH,
        (T_16550UART *)LPC_USART3_BASE,
        (TISRFPtr)ISerialUART3,
        25, // PCUART3
        };

/*---------------------------------------------------------------------------*
 * Requirement routines:
 *---------------------------------------------------------------------------*/
void LPC43xx_UART0_Require(
        T_uezGPIOPortPin aPinTXD0,
        T_uezGPIOPortPin aPinRXD0,
        T_uezGPIOPortPin aPinDIR0,
        T_uezGPIOPortPin aPinUCLK0)
{
    static const T_LPC43xx_SCU_ConfigList txd0[] = {
            {GPIO_P5_0,   SCU_NORMAL_DRIVE_DEFAULT(1)},
            {GPIO_P3_3,   SCU_NORMAL_DRIVE_DEFAULT(2)},
            {GPIO_P5_18,   SCU_NORMAL_DRIVE_DEFAULT(7)},
            {GPIO_P7_24,   SCU_NORMAL_DRIVE_DEFAULT(1)},
    };
    static const T_LPC43xx_SCU_ConfigList rxd0[] = {
            {GPIO_P5_1,   SCU_NORMAL_DRIVE_DEFAULT(1)},
            {GPIO_P3_4,   SCU_NORMAL_DRIVE_DEFAULT(2)},
            {GPIO_P7_25,   SCU_NORMAL_DRIVE_DEFAULT(1)},
            {GPIO_P4_11,   SCU_NORMAL_DRIVE_DEFAULT(7)},
    };
    static const T_LPC43xx_SCU_ConfigList dir0[] = {
            {GPIO_P5_6, SCU_NORMAL_DRIVE_DEFAULT(1)},
            {GPIO_P3_1, SCU_NORMAL_DRIVE_DEFAULT(2)},
            {GPIO_P7_23, SCU_NORMAL_DRIVE_DEFAULT(1)},
    };
    static const T_LPC43xx_SCU_ConfigList uclk0[] = {
            {GPIO_P5_2, SCU_NORMAL_DRIVE_DEFAULT(1)},
            {GPIO_P3_0, SCU_NORMAL_DRIVE_DEFAULT(2)},
            {GPIO_P7_22, SCU_NORMAL_DRIVE_DEFAULT(1)},
    };

    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("UART0", (T_halInterface *)&G_LPC43xx_Serial_UART0, 0,
            0);

