FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC43xx/LPC43xx_Serial.c
    LPC43xx_SCU_ConfigPinOrNone(aPinTXD0, txd0, ARRAY_COUNT(txd0));
    LPC43xx_SCU_ConfigPinOrNone(aPinRXD0, rxd0, ARRAY_COUNT(rxd0));
    LPC43xx_SCU_ConfigPinOrNone(aPinDIR0, dir0, ARRAY_COUNT(dir0));
    LPC43xx_SCU_ConfigPinOrNone(aPinUCLK0, uclk0, ARRAY_COUNT(uclk0));
}

void LPC43xx_UART1_Require(
        T_uezGPIOPortPin aPinTXD1,
        T_uezGPIOPortPin aPinRXD1,
        T_uezGPIOPortPin aPinCTS,
        T_uezGPIOPortPin aPinDCD,
        T_uezGPIOPortPin aPinDSR,
        T_uezGPIOPortPin aPinDTR,
        T_uezGPIOPortPin aPinRI,
        T_uezGPIOPortPin aPinRTS)
{
    static const T_LPC43xx_SCU_ConfigList cts1[] = {
            {GPIO_P2_13 , SCU_NORMAL_DRIVE_DEFAULT(4)},
            {GPIO_P7_7  , SCU_NORMAL_DRIVE_DEFAULT(2)},
            {GPIO_P1_4  , SCU_NORMAL_DRIVE_DEFAULT(1)},
            {GPIO_P6_1  , SCU_NORMAL_DRIVE_DEFAULT(2)},
    };
    static const T_LPC43xx_SCU_ConfigList dcd1[] = {
            {GPIO_P1_5  , SCU_NORMAL_DRIVE_DEFAULT(1)},
            {GPIO_P2_14 , SCU_NORMAL_DRIVE_DEFAULT(4)},
            {GPIO_P6_10 , SCU_NORMAL_DRIVE_DEFAULT(2)},
            {GPIO_P7_9  , SCU_NORMAL_DRIVE_DEFAULT(2)},
    };
    static const T_LPC43xx_SCU_ConfigList dsr1[] = {
            {GPIO_P2_9  , SCU_NORMAL_DRIVE_DEFAULT(4)},
            {GPIO_P1_0  , SCU_NORMAL_DRIVE_DEFAULT(1)},
            {GPIO_P6_9  , SCU_NORMAL_DRIVE_DEFAULT(2)},
            {GPIO_P7_8  , SCU_NORMAL_DRIVE_DEFAULT(2)},
    };
    static const T_LPC43xx_SCU_ConfigList dtr1[] = {
            {GPIO_P1_1  , SCU_NORMAL_DRIVE_DEFAULT(1)},
            {GPIO_P2_10 , SCU_NORMAL_DRIVE_DEFAULT(4)},
            {GPIO_P6_11 , SCU_NORMAL_DRIVE_DEFAULT(2)},
            {GPIO_P7_10 , SCU_NORMAL_DRIVE_DEFAULT(2)},
    };
    static const T_LPC43xx_SCU_ConfigList ri1[] = {
            {GPIO_P1_3  , SCU_NORMAL_DRIVE_DEFAULT(1)},
            {GPIO_P2_12 , SCU_NORMAL_DRIVE_DEFAULT(4)},
            {GPIO_P6_0  , SCU_NORMAL_DRIVE_DEFAULT(2)},
            {GPIO_P7_6  , SCU_NORMAL_DRIVE_DEFAULT(2)},
    };
    static const T_LPC43xx_SCU_ConfigList rts1[] = {
            {GPIO_P1_2  , SCU_NORMAL_DRIVE_DEFAULT(1)},
            {GPIO_P2_11 , SCU_NORMAL_DRIVE_DEFAULT(4)},
            {GPIO_P6_2  , SCU_NORMAL_DRIVE_DEFAULT(2)},
            {GPIO_P7_5  , SCU_NORMAL_DRIVE_DEFAULT(2)},
    };
    static const T_LPC43xx_SCU_ConfigList rxd1[] = {
            {GPIO_P1_7  , SCU_NORMAL_DRIVE_DEFAULT(1)},
            {GPIO_P1_15 , SCU_NORMAL_DRIVE_DEFAULT(4)},
            {GPIO_P2_7  , SCU_NORMAL_DRIVE_DEFAULT(4)},
            {GPIO_P6_13 , SCU_NORMAL_DRIVE_DEFAULT(2)},
            {GPIO_P7_12 , SCU_NORMAL_DRIVE_DEFAULT(2)},
    };
    static const T_LPC43xx_SCU_ConfigList txd1[] = {
            {GPIO_P1_6  , SCU_NORMAL_DRIVE_DEFAULT(1)},
            {GPIO_P1_14 , SCU_NORMAL_DRIVE_DEFAULT(4)},
            {GPIO_P2_15 , SCU_NORMAL_DRIVE_DEFAULT(4)},
            {GPIO_P6_12 , SCU_NORMAL_DRIVE_DEFAULT(2)},
            {GPIO_P7_11 , SCU_NORMAL_DRIVE_DEFAULT(2)},
    };

    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("UART1", (T_halInterface *)&G_LPC43xx_Serial_UART1, 0,
            0);

    LPC43xx_SCU_ConfigPinOrNone(aPinTXD1, txd1, ARRAY_COUNT(txd1));
    LPC43xx_SCU_ConfigPinOrNone(aPinRXD1, rxd1, ARRAY_COUNT(rxd1));
    LPC43xx_SCU_ConfigPinOrNone(aPinCTS, cts1, ARRAY_COUNT(cts1));
    LPC43xx_SCU_ConfigPinOrNone(aPinDCD, dcd1, ARRAY_COUNT(dcd1));
    LPC43xx_SCU_ConfigPinOrNone(aPinDSR, dsr1, ARRAY_COUNT(dsr1));
    LPC43xx_SCU_ConfigPinOrNone(aPinDTR, dtr1, ARRAY_COUNT(dtr1));
    LPC43xx_SCU_ConfigPinOrNone(aPinRI, ri1, ARRAY_COUNT(ri1));
    LPC43xx_SCU_ConfigPinOrNone(aPinRTS, rts1, ARRAY_COUNT(rts1));
}

void LPC43xx_UART2_Require(
        T_uezGPIOPortPin aPinTXD2,
        T_uezGPIOPortPin aPinRXD2,
        T_uezGPIOPortPin aPinDIR2,
        T_uezGPIOPortPin aPinUCLK2)
{
    static const T_LPC43xx_SCU_ConfigList dir2[] = {
            {GPIO_P0_13 , SCU_NORMAL_DRIVE_DEFAULT(1)},
            {GPIO_P1_13 , SCU_NORMAL_DRIVE_DEFAULT(7)},
    };
    static const T_LPC43xx_SCU_ConfigList rxd2[] = {
            {GPIO_P0_3  , SCU_NORMAL_DRIVE_DEFAULT(1)},
            {GPIO_P3_10 , SCU_NORMAL_DRIVE_DEFAULT(6)},
            {GPIO_P4_9  , SCU_NORMAL_DRIVE_DEFAULT(3)},
    };
    static const T_LPC43xx_SCU_ConfigList txd2[] = {
            {GPIO_P0_2  , SCU_NORMAL_DRIVE_DEFAULT(1)},
            {GPIO_P3_9  , SCU_NORMAL_DRIVE_DEFAULT(6)},
            {GPIO_P4_8  , SCU_NORMAL_DRIVE_DEFAULT(3)},
    };
    static const T_LPC43xx_SCU_ConfigList uclk2[] = {
            {GPIO_P0_12 , SCU_NORMAL_DRIVE_DEFAULT(1)},
            {GPIO_P1_12 , SCU_NORMAL_DRIVE_DEFAULT(7)},
    };

    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("UART2", (T_halInterface *)&G_LPC43xx_Serial_UART2, 0,
            0);
    LPC43xx_SCU_ConfigPinOrNone(aPinTXD2, txd2, ARRAY_COUNT(txd2));
    LPC43xx_SCU_ConfigPinOrNone(aPinRXD2, rxd2, ARRAY_COUNT(rxd2));
    LPC43xx_SCU_ConfigPinOrNone(aPinDIR2, dir2, ARRAY_COUNT(dir2));
    LPC43xx_SCU_ConfigPinOrNone(aPinUCLK2, uclk2, ARRAY_COUNT(uclk2));
}

void LPC43xx_UART3_Require(
        T_uezGPIOPortPin aPinTXD3,
        T_uezGPIOPortPin aPinRXD3,
        T_uezGPIOPortPin aPinBAUD3,
        T_uezGPIOPortPin aPinDIR3,
        T_uezGPIOPortPin aPinUCLK3)
{
    static const T_LPC43xx_SCU_ConfigList buad3[] = {
            {GPIO_P1_10 , SCU_NORMAL_DRIVE_DEFAULT(2)},
            {GPIO_P2_3  , SCU_NORMAL_DRIVE_DEFAULT(6)},
            {GPIO_P7_21 , SCU_NORMAL_DRIVE_DEFAULT(1)},
    };
    static const T_LPC43xx_SCU_ConfigList dir3[] = {
            {GPIO_P5_7  , SCU_NORMAL_DRIVE_DEFAULT(2)},
            {GPIO_P2_4  , SCU_NORMAL_DRIVE_DEFAULT(6)},
            {GPIO_P7_20 , SCU_NORMAL_DRIVE_DEFAULT(1)},
    };
    static const T_LPC43xx_SCU_ConfigList rxd3[] = {
            {GPIO_P1_11 , SCU_NORMAL_DRIVE_DEFAULT(2)},
            {GPIO_P5_4  , SCU_NORMAL_DRIVE_DEFAULT(2)},
            {GPIO_P2_2  , SCU_NORMAL_DRIVE_DEFAULT(6)},
            {GPIO_P5_17 , SCU_NORMAL_DRIVE_DEFAULT(7)},
            {GPIO_P7_18 , SCU_NORMAL_DRIVE_DEFAULT(1)},
    };
    static const T_LPC43xx_SCU_ConfigList txd3[] = {
            {GPIO_P0_14 , SCU_NORMAL_DRIVE_DEFAULT(2)},
            {GPIO_P5_3  , SCU_NORMAL_DRIVE_DEFAULT(2)},
            {GPIO_P2_1  , SCU_NORMAL_DRIVE_DEFAULT(6)},
            {GPIO_P4_15 , SCU_NORMAL_DRIVE_DEFAULT(7)},
            {GPIO_P7_17 , SCU_NORMAL_DRIVE_DEFAULT(1)},
    };
    static const T_LPC43xx_SCU_ConfigList uclk3[] = {
            {GPIO_P0_7  , SCU_NORMAL_DRIVE_DEFAULT(5)},
            {GPIO_P2_0  , SCU_NORMAL_DRIVE_DEFAULT(6)},
            {GPIO_P7_19 , SCU_NORMAL_DRIVE_DEFAULT(1)},
    };

    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("UART3", (T_halInterface *)&G_LPC43xx_Serial_UART3, 0,
            0);

    LPC43xx_SCU_ConfigPinOrNone(aPinTXD3, txd3, ARRAY_COUNT(txd3));
    LPC43xx_SCU_ConfigPinOrNone(aPinRXD3, rxd3, ARRAY_COUNT(rxd3));
    LPC43xx_SCU_ConfigPinOrNone(aPinBAUD3, buad3, ARRAY_COUNT(buad3));
    LPC43xx_SCU_ConfigPinOrNone(aPinDIR3, dir3, ARRAY_COUNT(dir3));
    LPC43xx_SCU_ConfigPinOrNone(aPinUCLK3, uclk3, ARRAY_COUNT(uclk3));
}

/*===========================================================================*
 * END OF FILE: SerialPorts.c
 *===========================================================================*/
